
## Plan Result (prod)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_v6_host
  * azurerm_key_vault_secret.redis_v6_password
  * azurerm_key_vault_secret.redis_v6_port
  * module.redis-v6.azurerm_private_endpoint.this[0]
  * module.redis-v6.azurerm_redis_cache.redis
  * module.redis-v6.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_v6_host will be created
  + resource "azurerm_key_vault_secret" "redis_v6_host" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "REDIS-V6-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-admin-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "Redis"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.redis_v6_password will be created
  + resource "azurerm_key_vault_secret" "redis_v6_password" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "REDIS-V6-PASSWORD"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-admin-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "Redis"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.redis_v6_port will be created
  + resource "azurerm_key_vault_secret" "redis_v6_port" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "REDIS-V6-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-admin-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "Redis"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.redis-v6.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "fact-admin-frontend-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "fact-admin-frontend-cache-prod"
      + subnet_id                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-2-prod"
      + tags                     = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-admin-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "fact-admin-frontend-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis-v6.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + access_keys_authentication_enabled = true
      + capacity                           = 1
      + family                             = "P"
      + hostname                           = (known after apply)
      + id                                 = (known after apply)
      + location                           = "uksouth"
      + minimum_tls_version                = "1.2"
      + name                               = "fact-admin-frontend-prod"
      + non_ssl_port_enabled               = false
      + port                               = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      + public_network_access_enabled      = false
      + redis_version                      = "6"
      + replicas_per_master                = (known after apply)
      + replicas_per_primary               = (known after apply)
      + resource_group_name                = "fact-admin-frontend-cache-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_connection_string        = (sensitive value)
      + sku_name                           = "Premium"
      + ssl_port                           = (known after apply)
      + tags                               = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-admin-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
        }
      + zones                              = [
          + "1",
          + "2",
          + "3",
        ]

      + redis_configuration {
          + authentication_enabled          = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.redis-v6.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "fact-admin-frontend-cache-prod"
      + tags     = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-admin-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->